In [1]:
import pandas as pd

df_orig = pd.read_excel('sales_cleanup.xlsx')
df = df_orig.copy()

In [2]:
df['Sales'] = df['Sales'].str.replace(',', '')
df['Sales'] = df['Sales'].str.replace('$', '')
df['Sales']

0        NaN
1    1000.00
2        NaN
3     750.01
4        NaN
5        NaN
Name: Sales, dtype: object

In [3]:
df = df_orig.copy()
df['Sales'].apply(type)

0      <class 'int'>
1      <class 'str'>
2    <class 'float'>
3      <class 'str'>
4      <class 'int'>
5      <class 'int'>
Name: Sales, dtype: object

In [4]:
df['Sales_Type'] = df['Sales'].apply(lambda x: type(x).__name__)

In [5]:
df

         Customer      Sales Sales_Type
0  Jones Brothers        500        int
1       Beta Corp  $1,000.00        str
2     Globex Corp      300.1      float
3            Acme    $750.01        str
4         Initech        300        int
5           Hooli        250        int

In [6]:
def clean_currency(x):
    """ If the value is a string, then remove currency symbol and delimiters
    otherwise, the value is numeric and can be converted
    """
    if isinstance(x, str):
        return(x.replace('$', '').replace(',', ''))
    return(x)

In [7]:
df['Sales'] = df['Sales'].apply(clean_currency).astype('float')
df['Sales_Type'] = df['Sales'].apply(lambda x: type(x).__name__)

In [8]:
df

         Customer    Sales Sales_Type
0  Jones Brothers   500.00      float
1       Beta Corp  1000.00      float
2     Globex Corp   300.10      float
3            Acme   750.01      float
4         Initech   300.00      float
5           Hooli   250.00      float

In [10]:
df = df_orig.copy()
df['Sales'] = df['Sales'].replace({'\$': '', ',': ''}, regex=True).astype(float)

In [11]:
df

         Customer    Sales
0  Jones Brothers   500.00
1       Beta Corp  1000.00
2     Globex Corp   300.10
3            Acme   750.01
4         Initech   300.00
5           Hooli   250.00